<a href="https://colab.research.google.com/github/jimmy-io/worksheeets-/blob/master/03_Grouping_Alcohol_Consumption_Exercise_with_solutions.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [2]:
drinks = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv')
drinks.head()

       country  beer_servings  ...  total_litres_of_pure_alcohol  continent
0  Afghanistan              0  ...                           0.0         AS
1      Albania             89  ...                           4.9         EU
2      Algeria             25  ...                           0.7         AF
3      Andorra            245  ...                          12.4         EU
4       Angola            217  ...                           5.9         AF

[5 rows x 6 columns]

In [6]:
## Which continent drinks more beer on average?

drinks.groupby('continent').mean().sort_values(by = 'beer_servings', ascending = False).head(1)

           beer_servings  ...  total_litres_of_pure_alcohol
continent                 ...
EU            193.777778  ...                      8.617778

[1 rows x 4 columns]

In [13]:
##  For each continent print the statistics for wine consumption.

drinks.groupby('continent')['wine_servings'].describe()

           count        mean        std  min   25%    50%     75%    max
continent
AF          53.0   16.264151  38.846419  0.0   1.0    2.0   13.00  233.0
AS          44.0    9.068182  21.667034  0.0   0.0    1.0    8.00  123.0
EU          45.0  142.222222  97.421738  0.0  59.0  128.0  195.00  370.0
OC          16.0   35.625000  64.555790  0.0   1.0    8.5   23.25  212.0
SA          12.0   62.416667  88.620189  1.0   3.0   12.0   98.50  221.0

In [14]:
##  Print the mean alcohol consumption per continent for every column

drinks.groupby('continent')['total_litres_of_pure_alcohol'].mean()

continent
AF    3.007547
AS    2.170455
EU    8.617778
OC    3.381250
SA    6.308333
Name: total_litres_of_pure_alcohol, dtype: float64

In [15]:
##Print the median alcohol consumption per continent for every column

drinks.groupby('continent').median()

           beer_servings  ...  total_litres_of_pure_alcohol
continent                 ...
AF                  32.0  ...                          2.30
AS                  17.5  ...                          1.20
EU                 219.0  ...                         10.00
OC                  52.5  ...                          1.75
SA                 162.5  ...                          6.85

[5 rows x 4 columns]

In [18]:
## Print the mean, min and max values for spirit consumption.

drinks.groupby('continent')['total_litres_of_pure_alcohol'].agg(['mean', 'min', 'max'])

               mean  min   max
continent
AF         3.007547  0.0   9.1
AS         2.170455  0.0  11.5
EU         8.617778  0.0  14.4
OC         3.381250  0.0  10.4
SA         6.308333  3.8   8.3